package lesson_02.homework;

public class Task_02 {
//    Задача 2. Дано: Стороны квадрата a = 50, b = 20. Найти площадь.
//    Вывести на консоль
    public static void main(String[] args) {
        int a = 50;
        int b = 20;

        System.out.println("Площадь квадрата равна "+a*b);
    }
}
