package lesson_05.homework.optional;

public class Task_01 {
//    Массивы + String
//    Задача 1.
//    Программа вводит строки, пока пользователь не введёт пустую строку (нажав enter).
//    Потом она конвертирует строки в верхний регистр (Мама превращается в МАМА) и выводит их на экран.
//
//    Новая задача: Программа вводит строки, пока пользователь не введёт пустую строку (нажав enter).
//    Если в строке чётное число букв, строка удваивается, если нечётное - утраивается.
//    Программа выводит слова на экран.
}
